using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class LevelData : MonoBehaviour
{
    private const long maxLevelAmount = 10000000000;

    // 각 레벨 마다 필요한 경험치 1레벨일 때 50경험치 모으면 2레벨 됨
    static public List<int> data = new List<int>()
    {
        50, 100, 150, 200, 250, 300, 350, 400, 450, 500,
        550, 600, 650, 700, 750, 800, 850, 900, 950, 1000,
1050,
1100,
1150,
1200,
10000,
15000,
20000,
25000,
30000,
40000,
45000,
50000,
55000,
60000,
500000,
1000000,
1500000,
2000000,
2500000,
2500000,
2500000,
2500000,
2500000,
2500000,
2500000,
2500000,
2500000,
2500000,
2500000,
2500000,
2500000,
2500000,
2500000,
2500000
    };
}
